{
  "auto_mapping": null,
  "base_model_name_or_path": "google-t5/t5-small",
  "encoder_hidden_size": 512,
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 8,
  "num_layers": 6,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 20,
  "peft_type": "PREFIX_TUNING",
  "peft_version": "0.18.0",
  "prefix_projection": false,
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 512
}